/*
 * moto.h
 *
 *  Created on: 2025年6月6日
 *      Author:
 */

#ifndef USER_CODE_MOTO_H_
#define USER_CODE_MOTO_H_

// 需要包含的系统头文件
#include "zf_libraries_headfile.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     电机PWM初始化
// 返回参数     void
// 使用示例
// 备注信息     PE4对应PWM输出引脚，PE2对应DIR正反转引脚
//-------------------------------------------------------------------------------------------------------------------
void dlw_moto_pwm_init(void);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     电机设置占空比
// 参数说明     duty                要设置的占空比
// 返回参数     void
// 使用示例
// 备注信息     PE4对应PWM输出引脚，PE2对应DIR正反转引脚
//-------------------------------------------------------------------------------------------------------------------
void dlw_set_motor_duty(uint32 duty);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     电机控制
// 参数说明     channel_data           遥控器传入数据
// 返回参数     void
// 使用示例
// 备注信息     PE4对应PWM输出引脚，PE2对应DIR正反转引脚
//-------------------------------------------------------------------------------------------------------------------
void dlw_moto_control(uint16 channel_data);

#endif /* USER_CODE_MOTO_H_ */
