/*
 * led.c
 *
 *  Created on: 2025年6月4日
 *      Author: 刘珈琪
 */

#include "led.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     LED灯初始化
// 返回参数     void
// 使用示例
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void dlw_led_init(void)
{
	zf_gpio_init(G15 , GPO_PUSH_PULL, GPIO_HIGH);                 // 绿灯PG15初始化
	zf_gpio_init(G14 , GPO_PUSH_PULL, GPIO_HIGH);                 // 红灯PG14初始化
	zf_gpio_init(H0 , GPO_PUSH_PULL, GPIO_HIGH);                  // 蓝灯H0初始化
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     周期中断触发回调函数
// 参数说明     event           事件
// 参数说明     *ptr            用户传参句柄
// 返回参数     void            无返回值
// 使用示例
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void rgb_flicker_handler(uint32 event, void *ptr)
{
    (void)event;
    (void)ptr;
    zf_gpio_toggle_level(G15);
}
